Revit 2026 API

# FamilyItemFactoryNewExtrusionForm Method

---

Create new Form element by Extrude operation, and add it into the Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Form NewExtrusionForm(
	bool isSolid,
	ReferenceArray profile,
	XYZ direction
)
```
```vb
Public Function NewExtrusionForm (
	isSolid As Boolean,
	profile As ReferenceArray,
	direction As XYZ
) As Form
```
```cpp
public:
Form^ NewExtrusionForm(
	bool isSolid,
	ReferenceArray^ profile,
	XYZ^ direction
)
```
```fsharp
member NewExtrusionForm :
        isSolid : bool *
        profile : ReferenceArray *
        direction : XYZ -> Form
```

#### Parameters

isSolid Boolean
    Indicates if the Form is Solid or Void.
profile ReferenceArray
    The profile of extrusion. It should consist of only one curve loop.
direction XYZ
    The direction of extrusion, with its length the length of the extrusion. The direction must be perpendicular to the plane determined by profile. The length of vector must be non-zero.

#### Return Value

FormIf creation was successful new form is returned.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when creation is attempted in Conceptual Mass, 2D, or other family where extrusions cannot be created. |

#### Reference

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace